In [9]:
import pandas as pd
df = pd.read_csv(r"precios_semana_20200413.csv", sep=",", encoding="utf-8")
df.head(5)

   precio    producto_id sucursal_id
0   29.90  0000000001663     2-1-014
1   29.90  0000000002288     2-1-032
2   39.90  0000000002288     2-1-096
3  499.99  0000000205870     9-1-686
4  519.99  0000000205870     9-2-248

In [10]:
#rellena los datos nulos, en base al valor de la siguiente fila.
df=df.fillna(method="bfill")

In [11]:
contador1=df.isnull().sum()
contador1

precio         0
producto_id    0
sucursal_id    0
dtype: int64

In [12]:
df.head()

   precio    producto_id sucursal_id
0   29.90  0000000001663     2-1-014
1   29.90  0000000002288     2-1-032
2   39.90  0000000002288     2-1-096
3  499.99  0000000205870     9-1-686
4  519.99  0000000205870     9-2-248

In [13]:
df.head(5)

   precio    producto_id sucursal_id
0   29.90  0000000001663     2-1-014
1   29.90  0000000002288     2-1-032
2   39.90  0000000002288     2-1-096
3  499.99  0000000205870     9-1-686
4  519.99  0000000205870     9-2-248

In [14]:
#cambiamos de "." a ","
for i, elemento in enumerate(df['precio']):
   df['precio'][i] = str(df['precio'][i])
   #Transformaciones en los campos num√©ricos
for i, elemento in enumerate(df['precio']):
   elemento = elemento.replace('.', ',')
   df['precio'][i] = elemento

C:\Users\HP SUPPORT\AppData\Local\Temp\ipykernel_11844\219681451.py:3: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df['precio'][i] = str(df['precio'][i])

In [15]:
df.head()

   precio    producto_id sucursal_id
0    29,9  0000000001663     2-1-014
1    29,9  0000000002288     2-1-032
2    39,9  0000000002288     2-1-096
3  499,99  0000000205870     9-1-686
4  519,99  0000000205870     9-2-248

In [16]:
df.to_csv('precios_semana_20200413_ok.csv', index=False)